#Зад. 33 2019-SE-01 Напишете два скрипта (по един за всяка подточка), които четат редове от STDIN.
#Скриптовете трябва да обработват само редовете, които съдържат цели положителни или отрицателни числа;
#останалите редове се игнорират. Скриптовете трябва да извежда на STDOUT:
#а) всички уникални числа, чиято абсолютна стойност е равна на максималната абсолютна стойност сред всички числа
#Примерен вход:
#We don’t
#n11d n0
#educat10n
#12.3
#6
#33
#-42
#-42
#111
#111
#-111
#Примерен изход за а):
#-111
#111

#!/bin/bash

file=$(mktemp)

while read line; do
        if [[ ! $line =~ ^\-?[0-9]+$ ]]; then
                continue;
        fi
        echo "$line" >> $file

done

max_absolute=$(cat $file| tr -d '-' |sort -n | tail -1)
egrep "^\-?$max_absolute$" $file| sort |uniq

rm -- $file
