#include <stdio.h>
#include <unistd.h>
#include <err.h>
#include <fcntl.h>
#include <stdint.h>

int main (int argc, char* argv[]){

        if (argc != 3){
                errx(1,"Two arg needed");
        }

        int pd[2];
        if (pipe(pd) == -1){
                err(2,"error while piping");
        }
        pid_t p=fork();

        if (p == -1){
                err(3,"error during fork");
        }
        else if(p == 0){
                close(pd[0]);
                dup2(pd[1],1);
                execlp("cat", "cat", argv[1], (char*) NULL);
        }
        close(pd[1]);

        int fd = open(argv[2], O_CREAT  |O_WRONLY | O_TRUNC , S_IRWXU);
        uint8_t buf;
        while (read(pd[0], &buf, sizeof(buf)) > 0 ){
                if (buf == 0x55){
                        continue;
                }
                if (buf == 0x7D){

                        if (read(pd[0], &buf, sizeof(buf)) != sizeof(buf)){
                                err(4,"error while reading");
                        }


                uint8_t temp = buf ^ 0x20;
                        if (temp != 0x00 && temp != 0x55 && temp != 0xFF && temp != 0x70){
                                errx(5,"wrong file format");
                        }
                        write (fd, &temp,  sizeof(temp));

                }
                else{
                        write(fd, &buf, sizeof(buf));
                }
        }
        close(fd);
        close(pd[0]);

        return 0;
}
/* Зад. 85 2019-SE-01 Напишете програма-наблюдател P, която изпълнява друга програма Q и я рестар-
тира, когато Q завърши изпълнението си. На командния ред на P се подават следните параметри:
• праг за продължителност в секунди – едноцифрено число от 1 до 9
• Q
• незадължителни параметри на Q
P работи по следния алгоритъм:
• стартира Q с подадените параметри
• изчаква я да завърши изпълнението си
• записва в текстов файл run.log един ред с три полета - цели числа (разделени с интервал):
– момент на стартиране на Q (Unix time)
– момент на завършване на Q (Unix time)
– код за грешка, с който Q е завършила (exit code)
• проверява дали е изпълнено условието за спиране и ако не е, преминава отново към старти-
рането на Q
Условие за спиране: Ако наблюдателят P установи, че при две последователни изпълнения на Q са
били изпълнени и двете условия:
1. кодът за грешка на Q е бил различен от 0;
2. разликата между момента на завършване и момента на стартиране на Q е била по-малка от
подадения като първи параметър на P праг;
то P спира цикъла от изпълняване на Q и сам завършва изпълнението си.
Текущото време във формат Unix time (секунди от 1 януари 1970 г.) можете да вземете с извикване
на системната функция time() с параметър NULL; функцията е дефинирана в time.h. Ако изпълне-
ната програма е била прекъсната от подаден сигнал, това се приема за завършване с код за грешка
129.*/
